RT-Thread/rt-thread/bsp/apm32/libraries/APM32S10x_Library/APM32S10x_StdPeriphDriver/src/apm32s10x_tmr.c
    TMR_SelectInputTrigger(tmr, triggerSource);
    tmr->SMCTRL_B.SMFSEL = 0x07;
}

/*!
 * @brief     Configure the External clock Mode1
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     prescaler: specify the external Trigger Prescaler
 *              The parameter can be one of following values:
 *              @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *              @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *              @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *              @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specify the TMR IC polarity
 *              The parameter can be one of following values:
 *              @arg TMR_EXTTRG_POL_INVERTED:    Active low or falling edge active
 *              @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETRClockMode1(TMR_T* tmr, TMR_EXTTRG_PSC_T prescaler,
                             TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    TMR_ConfigETR(tmr, prescaler, polarity, filter);
    tmr->SMCTRL_B.SMFSEL = BIT_RESET;
    tmr->SMCTRL_B.SMFSEL = 0x07;
    tmr->SMCTRL_B.TRGSEL = 0x07;
}

/*!
 * @brief     Configure the External clock Mode2
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     prescaler: specify the external Trigger Prescaler
 *              The parameter can be one of following values:
 *              @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *              @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *              @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *              @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specify the TMR IC polarity
 *              The parameter can be one of following values:
 *              @arg TMR_EXTTRG_POL_INVERTED:    Active low or falling edge active
 *              @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETRClockMode2(TMR_T* tmr, TMR_EXTTRG_PSC_T prescaler,
                             TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    TMR_ConfigETR(tmr, prescaler, polarity, filter);
    tmr->SMCTRL_B.ECEN = ENABLE;
}
/*!
 * @brief     Configure the TMRx External Trigger (ETR).
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     prescaler: specify the external Trigger Prescaler
 *              The parameter can be one of following values:
 *              @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *              @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *              @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *              @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specify the TMR IC polarity
 *              The parameter can be one of following values:
 *              @arg TMR_EXTTRG_POL_INVERTED:    Active low or falling edge active
 *              @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETR(TMR_T* tmr, TMR_EXTTRG_PSC_T prescaler,
                   TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    tmr->SMCTRL &= 0x00FF;
    tmr->SMCTRL_B.ETPCFG = prescaler;
    tmr->SMCTRL_B.ETPOL = polarity;
    tmr->SMCTRL_B.ETFCFG = filter;
}

/*!
 * @brief     Configure the TMRx prescaler.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     prescaler: specify the prescaler Register value
 *
 * @param     pscReloadMode: specify the TMR prescaler Reload mode
 *              The parameter can be one of following values:
 *              @arg TMR_PSC_RELOAD_UPDATE:    The Prescaler is loaded at the update event
 *              @arg TMR_PSC_RELOAD_IMMEDIATE: The Prescaler is loaded immediately
 *
 * @retval    None
 */
void TMR_ConfigPrescaler(TMR_T* tmr, uint16_t prescaler, TMR_PSC_RELOAD_T pscReloadMode)
{
    tmr->PSC = prescaler;
    tmr->CEG_B.UEG = pscReloadMode;
}

/*!
 * @brief     Configure counter mode
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     countMode:specify the Counter Mode to be used
 *                     The parameter can be one of following values:
 *                     @arg TMR_COUNTER_MODE_UP:   Timer Up Counting Mode
 *                     @arg TMR_COUNTER_MODE_DOWN: Timer Down Counting Mode
 *                     @arg TMR_COUNTER_MODE_CENTERALIGNED1: Timer Center Aligned Mode1
 *                     @arg TMR_COUNTER_MODE_CENTERALIGNED2: Timer Center Aligned Mode2
 *                     @arg TMR_COUNTER_MODE_CENTERALIGNED3: Timer Center Aligned Mode3
 *
 * @retval   None
 */
void TMR_ConfigCounterMode(TMR_T* tmr, TMR_COUNTER_MODE_T countMode)
{
    tmr->CTRL1_B.CNTDIR = BIT_RESET;
    tmr->CTRL1_B.CAMSEL = BIT_RESET;
    tmr->CTRL1 |= countMode;
}

/*!
 * @brief     Select the Input Trigger source
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     triggerSource: specify the Input Trigger source
 *                     The parameter can be one of following values:
 *                     @arg TMR_TRIGGER_SOURCE_ITR0: Internal Trigger 0
 *                     @arg TMR_TRIGGER_SOURCE_ITR1: Internal Trigger 1
 *                     @arg TMR_TRIGGER_SOURCE_ITR2: Internal Trigger 2
 *                     @arg TMR_TRIGGER_SOURCE_ITR3: Internal Trigger 3
 *                     @arg TMR_TRIGGER_SOURCE_TI1F_ED: TI1 Edge Detector
 *                     @arg TMR_TRIGGER_SOURCE_TI1FP1: Filtered Timer Input 1
 *                     @arg TMR_TRIGGER_SOURCE_TI2FP2: Filtered Timer Input 2
 *                     @arg TMR_TRIGGER_SOURCE_ETRF: External Trigger input
 *
 * @retval    None
 */
void TMR_SelectInputTrigger(TMR_T* tmr, TMR_TRIGGER_SOURCE_T triggerSource)
{
    tmr->SMCTRL_B.TRGSEL = BIT_RESET;
    tmr->SMCTRL_B.TRGSEL = triggerSource;
}

/*!
 * @brief     Configure the Encoder Interface.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     encodeMode: specify the Encoder Mode
 *              The parameter can be one of following values:
 *              @arg TMR_ENCODER_MODE_TI1:  Counter counts on TI1FP1 edge depending on TI2FP2 level
 *              @arg TMR_ENCODER_MODE_TI2:  Counter counts on TI2FP2 edge depending on TI1FP1 level
 *              @arg TMR_ENCODER_MODE_TI12: Counter counts on both TI1FP1 and TI2FP2 edges depending
 *                                          on the level of the other input
 *
 * @param     IC1Polarity: specify the TMR IC1 polarity
 *              The parameter can be one of following values:
 *              @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *              @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @param     IC2Polarity: specify the TMR IC2 polarity
 *              The parameter can be one of following values:
 *              @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *              @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @retval    None
 */
void TMR_ConfigEncodeInterface(TMR_T* tmr, TMR_ENCODER_MODE_T encodeMode, TMR_IC_POLARITY_T IC1Polarity,
                               TMR_IC_POLARITY_T IC2Polarity)
{
    tmr->SMCTRL_B.SMFSEL = BIT_RESET;
    tmr->SMCTRL_B.SMFSEL = encodeMode;

    tmr->CCM1_CAPTURE_B.CC1SEL = BIT_RESET ;
    tmr->CCM1_CAPTURE_B.CC2SEL = BIT_RESET ;
    tmr->CCM1_CAPTURE_B.CC1SEL = 0x01 ;
    tmr->CCM1_CAPTURE_B.CC2SEL = 0x01 ;

    tmr->CCEN_B.CC1POL = BIT_RESET;
    tmr->CCEN_B.CC2POL = BIT_RESET;
    tmr->CCEN |= ((IC1Polarity | (IC2Polarity << 4)));
}

/*!
 * @brief     Force the output 1 waveform to active or inactive level.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     forcesAction: specify the forced Action to be set to the output waveform
 *              The parameter can be one of following values:
 *              @arg TMR_FORCED_ACTION_ACTIVE:   Force active level on OC1REF
 *              @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC1(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM1_COMPARE_B.OC1MOD = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC1MOD = forcesAction;
}

/*!
 * @brief     Force the output 2 waveform to active or inactive level.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     forcesAction: specify the forced Action to be set to the output waveform
 *              The parameter can be one of following values:
 *              @arg TMR_FORCED_ACTION_ACTIVE:   Force active level on OC1REF
 *              @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC2(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM1_COMPARE_B.OC2MOD = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC2MOD = forcesAction;
}

/*!
 * @brief     Force the output 3 waveform to active or inactive level.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     forcesAction: specify the forced Action to be set to the output waveform
 *              The parameter can be one of following values:
 *              @arg TMR_FORCED_ACTION_ACTIVE:   Force active level on OC1REF
 *              @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC3(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM2_COMPARE_B.OC3MOD = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC3MOD = forcesAction;
}

/*!
 * @brief     Force the output 4 waveform to active or inactive level.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     forcesAction: specify the forced Action to be set to the output waveform
 *              The parameter can be one of following values:
 *              @arg TMR_FORCED_ACTION_ACTIVE:   Force active level on OC1REF
 *              @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC4(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM2_COMPARE_B.OC4MOD = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC4MOD = forcesAction;
}

/*!
 * @brief     Enable peripheral Preload register on AUTORLD.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @retval    None
 */
void TMR_EnableAutoReload(TMR_T* tmr)
{
    tmr->CTRL1_B.ARPEN = ENABLE;
}

/*!
 * @brief     Disable peripheral Preload register on AUTORLD.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @retval    None
 */
void TMR_DisableAutoReload(TMR_T* tmr)
{
    tmr->CTRL1_B.ARPEN = DISABLE;
}

/*!
 * @brief     Enable the specified TMR peripheral Commutation event.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @retval    None
 */
void TMR_EnableSelectCOM(TMR_T* tmr)
{
    tmr->CTRL2_B.CCUSEL = ENABLE;
}
/*!
 * @brief     Disable the specified TMR peripheral Commutation event.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @retval    None
 */
void TMR_DisableSelectCOM(TMR_T* tmr)
{
    tmr->CTRL2_B.CCUSEL = DISABLE;
}

/*!
 * @brief     Enable the Capture Compare DMA source.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @retval    None
 */
void TMR_EnableCCDMA(TMR_T* tmr)
{
    tmr->CTRL2_B.CCDSEL = ENABLE;
}

/*!
 * @brief     Disable the Capture Compare DMA source.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @retval    None
 */
void TMR_DisableCCDMA(TMR_T* tmr)
{
    tmr->CTRL2_B.CCDSEL = DISABLE;
}

/*!
 * @brief     Enable the Capture Compare Preload Control bit.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @retval    None
 */
void TMR_EnableCCPreload(TMR_T* tmr)
{
    tmr->CTRL2_B.CCPEN = ENABLE;
}

/*!
 * @brief     Disable the Capture Compare Preload Control bit.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @retval    None
 */
void TMR_DisableCCPreload(TMR_T* tmr)
{
    tmr->CTRL2_B.CCPEN = DISABLE;
}

/*!
 * @brief     Enable or disable the peripheral Preload register on CCM1.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCPreload: specify the Output Compare Channel Preload
 *              The parameter can be one of following values:
 *              @arg TMR_OC_PRELOAD_DISABLE
 *              @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC1Preload(TMR_T* tmr, TMR_OC_PRELOAD_T OCPreload)
{
    tmr->CCM1_COMPARE_B.OC1PEN = OCPreload;
}

/*!
 * @brief     Enable or disable the peripheral Preload register on CCM2.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCPreload: specify the Output Compare Channel Preload
 *              The parameter can be one of following values:
 *              @arg TMR_OC_PRELOAD_DISABLE
 *              @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC2Preload(TMR_T* tmr, TMR_OC_PRELOAD_T OCPreload)
{
    tmr->CCM1_COMPARE_B.OC2PEN = OCPreload;
}

/*!
 * @brief     Enable or disable the peripheral Preload register on CCM3.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCPreload: specify the Output Compare Channel Preload
 *              The parameter can be one of following values:
 *              @arg TMR_OC_PRELOAD_DISABLE
 *              @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC3Preload(TMR_T* tmr, TMR_OC_PRELOAD_T OCPreload)
{
    tmr->CCM2_COMPARE_B.OC3PEN = OCPreload;
}

/*!
 * @brief     Enable or disable the peripheral Preload register on CCM4.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCPreload: specify the Output Compare Channel Preload
 *              The parameter can be one of following values:
 *              @arg TMR_OC_PRELOAD_DISABLE
 *              @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    Nonee
 */
void TMR_ConfigOC4Preload(TMR_T* tmr, TMR_OC_PRELOAD_T OCPreload)
{
    tmr->CCM2_COMPARE_B.OC4PEN = OCPreload;
}

/*!
 * @brief     Configure the Output Compare 1 Fast feature.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCFast: specify the Output Compare Channel Fast
 *              The parameter can be one of following values:
 *              @arg TMR_OC_FAST_DISABLE
 *              @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC1Fast(TMR_T* tmr, TMR_OC_FAST_T OCFast)
{
    tmr->CCM1_COMPARE_B.OC1FEN = OCFast;
}

/*!
 * @brief     Configure the Output Compare 2 Fast feature.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCFast: specify the Output Compare Channel Fast
 *              The parameter can be one of following values:
 *              @arg TMR_OC_FAST_DISABLE
 *              @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC2Fast(TMR_T* tmr, TMR_OC_FAST_T OCFast)
{
    tmr->CCM1_COMPARE_B.OC2FEN = OCFast;
}

/*!
 * @brief     Configure the Output Compare 2 Fast feature.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCFast: specify the Output Compare Channel Fast
 *              The parameter can be one of following values:
 *              @arg TMR_OC_FAST_DISABLE
 *              @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC3Fast(TMR_T* tmr, TMR_OC_FAST_T OCFast)
{
    tmr->CCM2_COMPARE_B.OC3FEN = OCFast;
}

/*!
 * @brief     Configure the Output Compare 4 Fast feature.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCFast: specify the Output Compare Channel Fast
 *              The parameter can be one of following values:
 *              @arg TMR_OC_FAST_DISABLE
 *              @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC4Fast(TMR_T* tmr, TMR_OC_FAST_T OCFast)
{
    tmr->CCM2_COMPARE_B.OC4FEN = OCFast;
}

/*!
 * @brief     Clear or safeguard the OCREF1 signal on an external event
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCClear: specify the Output Compare Channel1 Clear
 *              The parameter can be one of following values:
 *              @arg TMR_OC_CLEAR_DISABLE
 *              @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC1Ref(TMR_T* tmr, TMR_OC_CLEAR_T OCClear)
{
    tmr->CCM1_COMPARE_B.OC1CEN = OCClear;
}

/*!
 * @brief     Clear or safeguard the OCREF2 signal on an external event
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCClear: specify the Output Compare Channel1 Clear
 *              The parameter can be one of following values:
 *              @arg TMR_OC_CLEAR_DISABLE
 *              @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC2Ref(TMR_T* tmr, TMR_OC_CLEAR_T OCClear)
{
    tmr->CCM1_COMPARE_B.OC2CEN = OCClear;
}

/*!
 * @brief     Clear or safeguard the OCREF3 signal on an external event
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCClear: specify the Output Compare Channel1 Clear
 *              The parameter can be one of following values:
 *              @arg TMR_OC_CLEAR_DISABLE
 *              @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC3Ref(TMR_T* tmr, TMR_OC_CLEAR_T OCClear)
{
    tmr->CCM2_COMPARE_B.OC3CEN = OCClear;
}

/*!
 * @brief     Clear or safeguard the OCREF4 signal on an external event
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     OCClear: specify the Output Compare Channel1 Clear
 *              The parameter can be one of following values:
 *              @arg TMR_OC_CLEAR_DISABLE
 *              @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC4Ref(TMR_T* tmr, TMR_OC_CLEAR_T OCClear)
{
    tmr->CCM2_COMPARE_B.OC4CEN = OCClear;
}

/*!
 * @brief     Configure the channel 1 polarity.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     polarity: specify the OC1 Polarity
 *              The parameter can be one of following values:
 *              @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *              @arg TMR_OC_POLARITY_LOW:  Output Compare active low
 *
 * @retval    Nonee
 */
void TMR_ConfigOC1Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC1POL = polarity;
}

/*!
 * @brief     Configure the  channel 1 nPolarity.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @param     nPolarity: specify the OC1 nPolarity
 *              The parameter can be one of following values:
 *              @arg TMR_OC_NPOLARITY_HIGH: Output Compare active high
 *              @arg TMR_OC_NPOLARITY_LOW:  Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC1NPolarity(TMR_T* tmr, TMR_OC_NPOLARITY_T nPolarity)
{
    tmr->CCEN_B.CC1NPOL = nPolarity;
}

/*!
 * @brief     Configure the channel 2 polarity.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     polarity: specify the OC2 Polarity
 *              The parameter can be one of following values:
 *              @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *              @arg TMR_OC_POLARITY_LOW:  Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC2Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC2POL = polarity;
}

/*!
 * @brief     Configure the  channel 2 nPolarity.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @param     nPolarity: specify the OC2 nPolarity
 *              The parameter can be one of following values:
 *              @arg TMR_OC_NPOLARITY_HIGH: Output Compare active high
 *              @arg TMR_OC_NPOLARITY_LOW:  Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC2NPolarity(TMR_T* tmr, TMR_OC_NPOLARITY_T nPolarity)
{
    tmr->CCEN_B.CC2NPOL = nPolarity;
}

/*!
 * @brief     Configure the channel 3 polarity.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     polarity: specify the OC3 Polarity
 *              The parameter can be one of following values:
 *              @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *              @arg TMR_OC_POLARITY_LOW:  Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC3Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC3POL = polarity;
}

/*!
 * @brief     Configure the  channel 3 nPolarity.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @param     nPolarity: specify the OC3 nPolarity
 *              The parameter can be one of following values:
 *              @arg TMR_OC_NPOLARITY_HIGH: Output Compare active high
 *              @arg TMR_OC_NPOLARITY_LOW:  Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC3NPolarity(TMR_T* tmr, TMR_OC_NPOLARITY_T nPolarity)
{
    tmr->CCEN_B.CC3NPOL = nPolarity;
}

/*!
 * @brief     Configure the channel 4 polarity.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     polarity: specify the OC4 Polarity
 *              The parameter can be one of following values:
 *              @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *              @arg TMR_OC_POLARITY_LOW:  Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC4Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC4POL = polarity;
}

/*!
 * @brief     Enable the Capture Compare Channel x.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     channel: specify the Channel
 *              The parameter can be one of following values:
 *              @arg TMR_CHANNEL_1: Timer Channel 1
 *              @arg TMR_CHANNEL_2: Timer Channel 2
 *              @arg TMR_CHANNEL_3: Timer Channel 3
 *              @arg TMR_CHANNEL_4: Timer Channel 4
 *
 * @retval    None
 */
void TMR_EnableCCxChannel(TMR_T* tmr, TMR_CHANNEL_T channel)
{
    tmr->CCEN |= BIT_SET << channel;
}

/*!
 * @brief     Disable the Capture Compare Channel x.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     channel: specify the Channel
 *              The parameter can be one of following values:
 *              @arg TMR_CHANNEL_1: Timer Channel 1
 *              @arg TMR_CHANNEL_2: Timer Channel 2
 *              @arg TMR_CHANNEL_3: Timer Channel 3
 *              @arg TMR_CHANNEL_4: Timer Channel 4
 * @retval    None
 */
void TMR_DisableCCxChannel(TMR_T* tmr, TMR_CHANNEL_T channel)
{
    tmr->CCEN &= ~(BIT_SET << channel);
}

/*!
 * @brief     Enable the Capture Compare Channelx N.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @param     channel: specify the Channel
 *              The parameter can be one of following values:
 *              @arg TMR_CHANNEL_1: Timer Channel 1
 *              @arg TMR_CHANNEL_2: Timer Channel 2
 *              @arg TMR_CHANNEL_3: Timer Channel 3
 *
 * @retval    None
 */
void TMR_EnableCCxNChannel(TMR_T* tmr, TMR_CHANNEL_T channel)
{
    tmr->CCEN |= 0x04 << channel;
}

/*!
 * @brief     Disable the Capture Compare Channelx N.
 *
 * @param     tmr: The TMRx it can be TMR1
 *
 * @param     channel: specify the Channel
 *              The parameter can be one of following values:
 *              @arg TMR_CHANNEL_1: Timer Channel 1
 *              @arg TMR_CHANNEL_2: Timer Channel 2
 *              @arg TMR_CHANNEL_3: Timer Channel 3
 *
 * @retval    None
 */
void TMR_DisableCCxNChannel(TMR_T* tmr, TMR_CHANNEL_T channel)
{
    tmr->CCEN &= ~(0x04 << channel);
}

/*!
 * @brief     Select the Output Compare Mode.
 *
 * @param     tmr: The TMRx can be 1 to 4
 *
 * @param     channel: specify the Channel
 *              The parameter can be one of following values:
 *              @arg TMR_CHANNEL_1: Timer Channel 1
 *              @arg TMR_CHANNEL_2: Timer Channel 2
 *              @arg TMR_CHANNEL_3: Timer Channel 3
 *              @arg TMR_CHANNEL_4: Timer Channel 4
 *
 * @param     mode: specify the Output Compare Mode
 *              The parameter can be one of following values:
 *              @arg TMR_OC_MODE_TMRING
 *              @arg TMR_OC_MODE_ACTIVE
 *              @arg TMR_OC_MODE_INACTIVE
 *              @arg TMR_OC_MODE_TOGGEL
 *              @arg TMR_OC_MODE_LOWLEVEL
 *              @arg TMR_OC_MODE_HIGHLEVEL
 *              @arg TMR_OC_MODE_PWM1
 *              @arg TMR_OC_MODE_PWM2
 *
 * @retval    None
 */
void TMR_SelectOCxMode(TMR_T* tmr, TMR_CHANNEL_T channel, TMR_OC_MODE_T mode)
{
    tmr->CCEN &= BIT_RESET << channel;

